const dynamic guessingLaoniaoPlayTypeLang = {
    "FT":[
    {
        "name":"ชนะและแพ้",
        "key":"M",
        "sort" : {
          'MH': 'ชนะ',
          'MN': 'เสมอ',
          'MC': 'แพ้',
        }
    },
    {
        "name" : "ต่อลูกชนะชนะแพ้",
        "key" : "W3",
        "sort" : {
          'W3H': 'ชนะ',
          'W3N': 'เสมอ',
          'W3C': 'แพ้',
        }
    },
    {
        "name":"คะแนน",
        "key":"PD",
        "sort_list" : {  //ตาางการจัดแข่งขัน
          'H1C0': '1:0',
          'H2C0': '2:0',
          'H2C1': '2:1',
          'H0C0': '0:0',
          'H1C1': '1:1',
          'H2C2': '2:2',
          'H0C1': '0:1',
          'H0C2': '0:2',
          'H1C2': '1:2',
        },
        "sort" : {
          'H1C0': '1:0',
          'H2C0': '2:0',
          'H2C1': '2:1',
          'H3C0': '3:0',
          'H3C1': '3:1',
          'H3C2': '3:2',
          'H4C0': '4:0',
          'H4C1': '4:1',
          'H4C2': '4:2',
          'H4C3': '4:3',
          'H0C0': '0:0',
          'H1C1': '1:1',
          'H2C2': '2:2',
          'H3C3': '3:3',
          'H4C4': '4:4',
          'OVH': 'อื่นๆ',
          'H0C1': '0:1',
          'H0C2': '0:2',
          'H1C2': '1:2',
          'H0C3': '0:3',
          'H1C3': '1:3',
          'H2C3': '2:3',
          'H0C4': '0:4',
          'H1C4': '1:4',
          'H2C4': '2:4',
          'H3C4': '3:4',
        }
    },{
        "name" : "ประตูรวม",
        "key"  : "T",
        "sort" :{
          'T01': '0~1ลูก',
          'T23': '2~3ลูก',
          'T46': '4~6ลูก',
          'OVER': '7+ลูก'
        }
    },
    {
        "name" : "ครึ่งสนาม",
        "key" : "F",
        "sort" : {
          'FHH': 'ชนะ/ชนะ',
          'FHN': 'ชนะ/เสมอ',
          'FHC': 'ชนะ/แพ้',
          'FNH': 'เสมอ/ชนะ',
          'FNN': 'เสมอ/เสมอ',
          'FNC': 'เสมอ/แพ้',
          'FCH': 'แพ้/ชนะ',
          'FCN': 'แพ้/เสมอ',
          'FCC': 'แพ้/แพ้',
          // 'FHH': 'เจ้าบ้าน/เจ้าบ้าน',
          // 'FHN': 'เจ้าบ้าน/ทีมรวม',
          // 'FHC': 'เจ้าบ้าน/ทีมรวม',
          // 'FNH': 'ทีมรวม/เจ้าบ้าน',
          // 'FNN': 'ทีมรวม/ทีมรวม',
          // 'FNC': 'ทีมรวม/ทีมเยือน',
          // 'FCH': 'ทีมเยือน/เจ้าบ้าน',
          // 'FCN': 'ทีมเยือน/ทีมรวม',
          // 'FCC': 'ทีมเยือนทีมเยือน',
        }
    },
    ],
    "BK":[
      {
          "name":"ชนะแพ้",
          "key":"M",
          "sort" : {
            'MH': 'ชนะ',
            'MC': 'แพ้',
          }
      },
      {
          "name" : "ใหญ่เล็กคะแนน",
          "key" : "OU",
          "sort" : {
            'OUC': 'ใหญ๋ {ratio}',
            'OUH': 'เล็ก {ratio}',
          }
      },{
        "name":"แฮนดิแคป",
        "key":"R",
        "sort" : {
          'RH': 'เจ้าบ้านชนะ {ratio}',
          'RC': 'ทีมเยือนชนะ {ratio}',
        }
      },
    ]
};

