import 'package:fast_ai/config/config.dart';

class ErrorCodeUtil{


  ///
  /// s 状态 Status
  /// Integer 选项状态可有多个，api 回传值为十进制数字，请 将此数值转十六进制，并与各状态做 AND 运算若结果与状态数值相同表示注单有此状态，仅赛事开放状态才可下注。
  /// 例 :
  ///   以回传值 20 为例，以 2 进制表示为 00101000，1 为包含的状态对应 4.10 表后则得 到 Opened,OddsGoUp 此两状 态，若以 20 个别 AND 4 及 16 将获得 4 及 16，表示包含此两个状 态
  /// {
  ///   None 0x0 0 无状态
  ///   ScoreChanged 0x1 1 分数变更
  ///   HandicapChanged 0x2 2 让分变更
  ///   OddsGoUp 0x4 4 赔率上升
  ///   OddsGoDown 0x8 8 赔率下降
  ///   Opened 0x10 16 赛事开放
  ///   Paused 0x20 32 赛事暂停
  ///   Closed 0x40 64 赛事关闭
  /// }
  ///
  static String getErrorCode(int s){

//    '0X001': {'pw': '网络请求超时，未能获取交易赔率...', 'bet': '受理失败：请检查您的网络…'},
//    '0X007': {'pw': '受理失败：请检查您的网络…', 'bet': ''},
//    '1X000': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：比赛信息错误...'},
//    '1X001': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：本场比赛已结束...'},
//    '1X002': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：超过交易时间…'},
//    '1X003': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：比赛状态变更，稍后再试…'},
//    '1X005': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：盘口发生变化，请重新选择…'},
//    '1X007': {'pw': '您所选的盘口已暂停', 'bet': '受理失败：比赛已封盘…'},
//    '1X009': {'pw': '您所选的盘口已暂停', 'bet': '受理失败：盘口已暂停..'},
//    '1X010': {'pw': '您所选的盘口已暂停', 'bet': '受理失败：赛事已关闭..'},
//    '1X013': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：赔率发生错误…'},
//    '1X014': {'pw': '对不起，您的登录已过期，请重新登录…', 'bet': ''},
//    '1X015': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：盘口发生变化，请重新选择…'},
//    '1X019': {'pw': '受理失败：串关超过最大赔付额,请减少本金…', 'bet': '受理失败：串关超过最大赔付额,请减少本金…'},
//    '1X020': {'pw': '受理失败：超过最大赔付额,请减少本金…', 'bet': '受理失败：超过最大赔付额,请减少本金…'},
//    '1X021': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：投注项重复…'},
//    '2X001': {'pw': '您所选的盘口已关闭', 'bet': '受理失败：盘口发生变化，请重新选择…'},
//    '301012': {'pw': '奇幻赛事不能进行串关投注', 'bet': '奇幻赛事不能进行串关投注'},
//    '301013': {'pw': '受理失败', 'bet': '该玩法不支持串关'},
//    '701024': {'pw': '受理失败', 'bet': '请检查您的网络…'},
    if(s & 0x40 == 0x40){//赛事关闭
      return '1X010';
    }
    if(s & 0x20 == 0x20){//赛事暂停
      return '1X009';
    }
    if(s & 0x0 == 0x0){//无状态
      return '';//''1X000';
    }
    if(s & 0x1 == 0x1){
      return '';
    }
    if(s & 0x2 == 0x2){
      return '';
    }
    if(s & 0x4 == 0x4){
      return '';
    }
    if(s & 0x8 == 0x8){
      return '';
    }
    if(s & 0x10 == 0x10){
      return '';
    }
    return '';
  }

  ///
  ///
  ///
  static String getErrorMsg(int s){
    if(s & 0x40 == 0x40){//赛事关闭
      return '${config.langMap['baseLang']['server']['matchClose']}';
    }
    if(s & 0x20 == 0x20){//赛事暂停
      return '${config.langMap['baseLang']['server']['matchPause']}';
    }
    if(s & 0x0 == 0x0){//无状态
      return '';//''您所选的盘口已关闭';
    }
    if(s & 0x1 == 0x1){
      return '';
    }
    if(s & 0x2 == 0x2){
      return '';
    }
    if(s & 0x4 == 0x4){
      return '';
    }
    if(s & 0x8 == 0x8){
      return '';
    }
    if(s & 0x10 == 0x10){
      return '';
    }
    return '';
  }
}