{
    "data" : [
        {
          "title" : "隐私政策（客户）" ,
          "subtitle" : [
              "本隐私政策将描述AI Sports如何处理您提供给我们的信息和数据，以帮助我们维系您与AI Sports的关系。",
              "我们将根据本隐私政策的规定来处理任何提供给我们的或我们所持有的关于您的个人信息。这些信息可能通过AI Sports网站（“网站”）、电话或任何其他方式提供。",
              "接受隐私条款即表示您已明白并接受根据本隐私政策的规定使用您的信息。如果您不同意本隐私政策中的条款，请不要使用网站或将您的个人信息提供给我们。"
          ]
        },
        {
          "title" : "保护您的个人数据" ,
          "subtitle" : [
              "您的个人数据不仅受到AI Sports高质量、高投入、高标准的保护，也受到法律的保护。法律规定，我们在处理您的个人信息时必须有正当理由，且理由须为下列之一：",
              "• 履行我们与您之间的任何合同",
              "• 我们对此有法律义务",
              "• 在您同意我们处理的情况下",
              "• 当符合我们的合法权益时",
              "• 当符合公共利益时",
              "• 当符合您的切身利益时"
          ]
        },
        {
          "title" : "正当权益" ,
          "subtitle" : [
              "当我们出于业务或商业原因处理您的个人数据时，此类情况称为正当权益。您的个人数据仍然受到保护，且我们不能以对您或您的利益不公的方式进行处理。",
              "当我们出于正当权益处理您的个人数据时，我们将把该情况和我们的正当权益告知给您，并为您提供一个提出疑问或异议的途径。但是，处理该信息的强烈正当理由可能会否决您的抗议权。"
          ]
        },
        {
          "title" : "我们保存您个人数据的时间" ,
          "subtitle" : [
              "您的数据保存在AI Sports时，我们将确保其受到合理保护，且仅用于可接受的目的。",
              "我们将在您作为AI Sports客户的期间保留您的数据。",
              "如果您不再是AI Sports的客户，为了完成本政策中所列目的并履行相关法律法规所规定的义务，我们将以所需的最短时间保留您的数据。如果我们因技术原因无法删除您的个人数据，其保留时间可能会延长。"
          ]
        },
        {
          "title" : "我们为什么处理您的个人数据" ,
          "subtitle" : [
              "如果您选择不提供个人数据，这有可能使我们无法履行法律及合同义务或提供您管理账户所需的服务。不提供您的个人数据可能导致我们无法为您提供产品或服务。"
          ]
        },
        {
          "title" : "信息收集" ,
          "subtitle" : [
              "我们可能收集、使用和处理的关于您的信息及数据包括：",
              "• 您通过在网站填写表格所提供给我们的信息，或者您通过网站或电子邮件提交给我们的任何其他信息",
              "• 通过网站、电子邮件、电话或其他途径提供的通讯记录",
              "• 您对我们进行的调查或客户研究所作的回答",
              "• 您通过网站、电话或其他途径与我们进行的交易详情",
              "• 您访问网站的详情，包括但不限于流量数据、定位数据、网络日志或其他通讯数据",
              "在正当合理且不会损害您的权利和自由的情况下，我们还会收集来自公共可用来源的个人数据，例如互联网搜索、广播媒体。"
          ]
        },
        {
          "title" : "电话通话" ,
          "subtitle" : [
              "出于培训和安全目的，我们会对来往于客户联系中心的电话进行录音，并对您在使用服务的过程中遇到的任何疑问的解决方案进行记录。"
          ]
        },
        {
          "title" : "我们产品的社交功能" ,
          "subtitle" : [
              "如果您选择参与我们产品所提供的任何社交功能（例如聊天室），则AI Sports可能会存储、记录或以其他方式处理这些数据。"
          ]
        },
        {
          "title" : "我们与他人分享的个人资料" ,
          "subtitle" : [
              "我们可能会在AI Sports集团内部分享您的个人资料，或与以下其他机构分享：",
              "• 执法机构，监管机构和其他权力部门",
              "• 信用评级机构",
              "• 反欺诈机构",
              "• 身份验证机构",
              "• 体育管理机构",
              "• 将您介绍给我们的组织",
              "• 按您的要求（或许可）与我们分享您的数据的第三方",
              "• 按您的要求提供产品或服务的必要第三方",
              "根据您选择使用的产品，我们可能需要与提供这些服务的第三方共享您的个人数据。",
              "我们也可能向合作或附属机构内的其他公司、商业合作伙伴或公司继承人披露个人信息。"

          ]
        },
        {
          "title" : "您对个人数据的权利" ,
          "subtitle" : [
              "我们将协助您对您的个人数据行使任何权利，包括：",
              "• 在我们请求您同意的任何情况下撤销同意，但这不会使我们之前经您同意的处理失效",
              "• 向任何相关的数据保护局投诉",
              "• 访问我们持有或处理的您的个人数据",
              "• 更正任何不正确或过时的个人数据",
              "• 删除我们处理的任何个人数据",
              "• 在特定情况下限制我们处理您的个人资料",
              "• 要求我们为您或您指定的其他公司提供您个人数据的某些方面，通常称为“转移权”",
              "• 反对我们为自身的正当权益而正在进行的数据处理",
              "• 对完全由自动化处理完成的决定提出异议、表达您的观点并请求人员审查决定"
          ]
        },
        {
          "title" : "对隐私声明的更改" ,
          "subtitle" : [
              "我们可能会不时更新本政策，请您经常查看。",
              "如果本隐私政策有任何重大变更，我们将尽合理的努力通过电子邮件、网站通知或其他商定的沟通渠道提前通知您。我们会提前将变更通知给您，让您在变更生效前有一定考虑和理解的时间。",
              "未经您的明确同意，我们不会对隐私政策实施重大变更。如果您拒绝接受隐私政策的更改，或在指定期限内不接受更改，我们将可能无法继续提供部分或全部的产品和服务。"
          ]
        }
  ]
}
